tutorials/heatTransfer/buoyantSimpleRadiationFoam/hotRadiationRoomFvDOM/0/G
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      G;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    floor
    {
        type            MarshakRadiation;
        T               T;
        emissivity      1;
        value           uniform 0;
    }

    fixedWalls
    {
        type            MarshakRadiation;
        T               T;
        emissivity      1;
        value           uniform 0;
    }

    ceiling
    {
        type            MarshakRadiation;
        T               T;
        emissivity      1;
        value           uniform 0;
    }

    box
    {
        type            MarshakRadiation;
        T               T;
        emissivity      1;
        value           uniform 0;
    }
}


// ************************************************************************* //
